; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-6-28)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s1)
	(at package5 s0)
	(at package6 s2)
	(at package7 s0)
	(at package8 s2)
	(at package9 s2)
	(at package10 s0)
	(at package11 s2)
	(at package12 s0)
	(at package13 s1)
	(at package14 s1)
	(at package15 s0)
	(at package16 s0)
	(at package17 s0)
	(at package18 s0)
	(at package19 s0)
	(at package20 s1)
	(at package21 s2)
	(at package22 s0)
	(at package23 s1)
	(at package24 s1)
	(at package25 s1)
	(at package26 s1)
	(at package27 s2)
	(at package28 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
)
	(:goal (and
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s1)
	(at truck3 s2)
	(at truck5 s1)
	(at truck6 s2)
	(at package1 s0)
	(at package2 s2)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s0)
	(at package10 s1)
	(at package11 s1)
	(at package12 s2)
	(at package13 s1)
	(at package14 s2)
	(at package15 s2)
	(at package16 s2)
	(at package17 s2)
	(at package18 s2)
	(at package19 s1)
	(at package20 s1)
	(at package21 s1)
	(at package22 s2)
	(at package23 s1)
	(at package24 s2)
	(at package25 s0)
	(at package26 s0)
	(at package27 s0)
	(at package28 s1)
	))


)

; plan
1. (board-truck driver2 s1 truck2)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 34
2. (load-truck s1 package4 truck2)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 7 of 34
3. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 7 of 34
4. (load-truck s0 package7 truck2)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   goals met: 7 of 34
5. (unload-truck s0 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   goals met: 8 of 34
6. (load-truck s0 package22 truck2)
   deleted: (at package22 s0)
   added: (in package22 truck2)
   goals met: 8 of 34
7. (load-truck s0 package2 truck2)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   goals met: 8 of 34
8. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 8 of 34
9. (load-truck s2 package9 truck2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 8 of 34
10. (load-truck s2 package8 truck2)
   deleted: (at package8 s2)
   added: (in package8 truck2)
   goals met: 8 of 34
11. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 8 of 34
12. (unload-truck s0 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 9 of 34
13. (unload-truck s0 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s0)
   goals met: 10 of 34
14. (load-truck s0 package19 truck2)
   deleted: (at package19 s0)
   added: (in package19 truck2)
   goals met: 10 of 34
15. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 10 of 34
16. (unload-truck s2 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s2)
   goals met: 11 of 34
17. (load-truck s2 package6 truck2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 11 of 34
18. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 11 of 34
19. (unload-truck s1 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   goals met: 12 of 34
20. (load-truck s1 package3 truck2)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 12 of 34
21. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 12 of 34
22. (unload-truck s2 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   goals met: 13 of 34
23. (load-truck s2 package27 truck2)
   deleted: (at package27 s2)
   added: (in package27 truck2)
   goals met: 13 of 34
24. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 13 of 34
25. (unload-truck s0 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s0)
   goals met: 14 of 34
26. (load-truck s0 package18 truck2)
   deleted: (at package18 s0)
   added: (in package18 truck2)
   goals met: 14 of 34
27. (load-truck s0 package17 truck2)
   deleted: (at package17 s0)
   added: (in package17 truck2)
   goals met: 14 of 34
28. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 14 of 34
29. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 14 of 34
30. (unload-truck s2 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s2)
   goals met: 15 of 34
31. (load-truck s2 package21 truck2)
   deleted: (at package21 s2)
   added: (in package21 truck2)
   goals met: 15 of 34
32. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 15 of 34
33. (load-truck s1 package26 truck2)
   deleted: (at package26 s1)
   added: (in package26 truck2)
   goals met: 15 of 34
34. (load-truck s1 package25 truck2)
   deleted: (at package25 s1)
   added: (in package25 truck2)
   goals met: 15 of 34
35. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 15 of 34
36. (unload-truck s0 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s0)
   goals met: 16 of 34
37. (unload-truck s0 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s0)
   goals met: 17 of 34
38. (load-truck s0 package16 truck2)
   deleted: (at package16 s0)
   added: (in package16 truck2)
   goals met: 17 of 34
39. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 34
40. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 17 of 34
41. (unload-truck s2 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   goals met: 18 of 34
42. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 19 of 34
43. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 19 of 34
44. (load-truck s1 package24 truck2)
   deleted: (at package24 s1)
   added: (in package24 truck2)
   goals met: 19 of 34
45. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 19 of 34
46. (unload-truck s2 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s2)
   goals met: 20 of 34
47. (unload-truck s2 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s2)
   goals met: 21 of 34
48. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 21 of 34
49. (unload-truck s1 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s1)
   goals met: 22 of 34
50. (unload-truck s1 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s1)
   goals met: 23 of 34
51. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 23 of 34
52. (unload-truck s2 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s2)
   goals met: 24 of 34
53. (load-truck s2 package11 truck2)
   deleted: (at package11 s2)
   added: (in package11 truck2)
   goals met: 24 of 34
54. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 24 of 34
55. (load-truck s1 package14 truck2)
   deleted: (at package14 s1)
   added: (in package14 truck2)
   goals met: 24 of 34
56. (unload-truck s1 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s1)
   goals met: 25 of 34
57. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 25 of 34
58. (unload-truck s2 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s2)
   goals met: 26 of 34
59. (board-truck driver1 s0 truck1)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 26 of 34
60. (load-truck s0 package15 truck1)
   deleted: (at package15 s0)
   added: (in package15 truck1)
   goals met: 26 of 34
61. (load-truck s0 package12 truck1)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 26 of 34
62. (load-truck s0 package10 truck1)
   deleted: (at package10 s0)
   added: (in package10 truck1)
   goals met: 26 of 34
63. (walk driver5 s1 p1-0)
   deleted: (at driver5 s1)
   added: (at driver5 p1-0)
   goals met: 26 of 34
64. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 27 of 34
65. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 28 of 34
66. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 27 of 34
67. (unload-truck s2 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s2)
   goals met: 28 of 34
68. (walk driver5 p1-0 s0)
   deleted: (at driver5 p1-0)
   added: (at driver5 s0)
   goals met: 29 of 34
69. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 30 of 34
70. (board-truck driver4 s2 truck5)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 29 of 34
71. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 28 of 34
72. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 29 of 34
73. (drive-truck driver4 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 29 of 34
74. (disembark-truck driver4 s0 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 29 of 34
75. (board-truck driver4 s0 truck6)
   deleted: (at driver4 s0) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 29 of 34
76. (drive-truck driver4 s0 s2 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   goals met: 30 of 34
77. (drive-truck driver5 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 29 of 34
78. (disembark-truck driver5 s0 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s0) (empty truck3)
   goals met: 30 of 34
79. (disembark-truck driver4 s2 truck6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s2) (empty truck6)
   goals met: 31 of 34
80. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 30 of 34
81. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 29 of 34
82. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 30 of 34
83. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 30 of 34
84. (disembark-truck driver1 s0 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 30 of 34
85. (drive-truck driver5 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 29 of 34
86. (disembark-truck driver5 s0 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s0) (empty truck3)
   goals met: 30 of 34
87. (board-truck driver5 s0 truck1)
   deleted: (at driver5 s0) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 29 of 34
88. (board-truck driver1 s0 truck5)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 29 of 34
89. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 30 of 34
90. (drive-truck driver5 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 31 of 34
91. (walk driver3 s1 p1-0)
   deleted: (at driver3 s1)
   added: (at driver3 p1-0)
   goals met: 31 of 34
92. (drive-truck driver5 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 30 of 34
93. (disembark-truck driver5 s0 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s0) (empty truck1)
   goals met: 31 of 34
94. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 30 of 34
95. (unload-truck s0 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s0)
   goals met: 30 of 34
96. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 31 of 34
97. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 31 of 34
98. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 31 of 34
99. (board-truck driver2 s0 truck1)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 31 of 34
100. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 32 of 34
101. (drive-truck driver5 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 31 of 34
102. (disembark-truck driver5 s0 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s0) (empty truck3)
   goals met: 32 of 34
103. (load-truck s0 package12 truck2)
   deleted: (at package12 s0)
   added: (in package12 truck2)
   goals met: 32 of 34
104. (board-truck driver5 s0 truck2)
   deleted: (at driver5 s0) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 31 of 34
105. (walk driver3 p1-0 s0)
   deleted: (at driver3 p1-0)
   added: (at driver3 s0)
   goals met: 31 of 34
106. (board-truck driver3 s0 truck3)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 31 of 34
107. (drive-truck driver3 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 32 of 34
108. (drive-truck driver5 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 32 of 34
109. (unload-truck s2 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s2)
   goals met: 33 of 34
110. (drive-truck driver5 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 33 of 34
111. (disembark-truck driver5 s0 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 34 of 34
